In [90]:
import numpy as np
import pandas as pd

In [98]:
# Create DataFrame
df=pd.DataFrame([[1,2,2,1],[2,1,1,1],[3,3,3,4],[3,3,4,4]],['a','b','c','d'])

In [99]:
df

   0  1  2  3
a  1  2  2  1
b  2  1  1  1
c  3  3  3  4
d  3  3  4  4

In [106]:
# Create duplicate row at end
df.iloc[0]
df = df.append(df.iloc[0]).tail()

In [107]:
df

   0  1  2  3
a  1  2  2  1
b  2  1  1  1
c  3  3  3  4
d  3  3  4  4
a  1  2  2  1

In [109]:
# Show duplicate rows
df.loc['a']

   0  1  2  3
a  1  2  2  1
a  1  2  2  1

In [111]:
df.duplicated()

a    False
b    False
c    False
d    False
a     True
dtype: bool

In [115]:
df=df.drop_duplicates()
df

   0  1  2  3
a  1  2  2  1
b  2  1  1  1
c  3  3  3  4
d  3  3  4  4

In [116]:
df.loc['a']

0    1
1    2
2    2
3    1
Name: a, dtype: int64